//
//  Question.swift
//  HspTest
//
//  Created by Chia on 2021/12/07.
//

import Foundation

let questionsA = [
    "聽到優美的音樂，會覺得興奮。",
    "每天花許多心力預測各種可能的失敗，並準備因應對策。",
    "善於察覺新的可能性或選擇。",
    "靈感源源不絕，常想出許多好點子。",
    "知道世界上存在著許多不是耳聽或眼見為憑的事物。",
    "很怕痛。",
    "他人眼裡微不足道的小事卻讓你深受打擊。",
    "每天都需要時間獨處。",
    "獨處再久都不覺得累，跟外人在一起不到兩三個小時就不行了。",
    "一發現氣氛變得很僵，就想趕快逃離現場。",
    "旁人發怒的對象就算不是自己，同樣備感壓力。",
    "對他人受到的傷痛彷彿深入神經般地感同身受。",
    "想盡一切辦法只為了想避開讓人不快的驚訝或誤解。",
    "充滿創意力。",
    "欣賞藝術作品時常深受感動。",
    "面對大量資訊或刺激時容易焦慮。",
    "不喜歡到遊樂園、大型購物中心、體育館等熱鬧的地方。",
    "看到電視上的暴力畫面，情緒會被影響好幾天。",
    "比一般人更願意花時間在思考上。",
    "善於觀察動植物的各種微小變化。",
    "在大自然的包圍下心情特別舒暢。",
    "隨時打開覺察的天線，善於觀察旁人的情緒。",
    "做出違背本心的決定時會很愧疚，充滿罪惡感。",
    "工作時若有人盯著你看會渾身不自在。",
    "善於看透真相，擁有察覺欺瞞的能力。",
    "容易受到驚嚇。",
    "善於與人深入交流。",
    "他人聽來覺得還好的聲音，你聽卻覺得特別刺耳。",
    "直覺很強。",
    "很享受獨處。",
    "極少衝動行事，習慣深思熟慮後再行動。",
    "對噪音、強烈的氣味、強光感到困擾。",
    "常常需要到安靜的空間稍微喘口氣。",
    "感到飢餓或寒冷時，餓跟冷的感覺一直在腦中揮之不去。",
    "很容易感動落淚。"
]

let questionsB = [
    "即使無法事先準備，也樂於接受新挑戰。",
    "當事情順著計畫走時，心裡會特別得意。",
    "對社交場合樂此不疲。",
    "喜愛生存體驗營。",
    "享受在壓力中工作。",
    "覺得人生若有不如意，問題大多在當事人自己身上。",
    "不太受到外界影響，隨時都能保持活力。",
    "參加聚會都是最後離開的那一個。",
    "甚少杞人憂天，凡事都能冷靜以對。",
    "週末喜歡跟朋友聚會，不需要刻意離開喘口氣。",
    "喜愛朋友的突然到訪。",
    "不太重視睡眠，睡一下就會飽。",
    "喜歡放煙火跟鞭炮。"
]

let questions = questionsA + questionsB
